//რა არის apis რა არის მისი გრძელი ფორმა და რისთვის გამოიყენება

// api არის საშვალება, რომლის მეშვეობითაც პროგრამები უკავშირდებიან ერთმანეთს და ინფორმაციებს უზიარებენ.
// შეგიძლია იმუშავო იმ მონაცემებთან რომლებიც შენს აპლიკაციას არ აქვს შენახული
// api - application programming interface

// api ის ტიპები:
// Rest - მუშაობს http ზე
// SOAP - იყენებს xml ს

// ფუნქციები: მონაცემების გაცვლა პროგრამებს შორის, უსაფრთხოება

// კონკრეტული მისამართი სადაც api-ს იძახებ -- htpps://

// api შეგვიძლია გამოვიყენოთ საიტებში , ტელეფონებზე.